app/Controllers/Auth.php

    public function register()
    {
        helper(['form']);

        $rules = [
        'name'          => 'required|min_length[3]|max_length[20]',
        'email'         => 'required|min_length[6]|max_length[50]|valid_email|is_unique[users.email]',
        'password'      => 'required|min_length[6]|max_length[200]',
        'confpassword'  => 'matches[password]',
        ];

        if($this->validate($rules))
        {
            $model = new UserModel();
            $data = [
                'name' => $this->request->getVar('name'),
                'email'=> $this->request->getVar('email'),
                'password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT)
            ];
            $model->save($data);
---
INSERT INTO `users` (`name`, `email`, `password`) VALUES ('test', 'test@gmail.com', '$2y$10$pmUHirW/rTgIBXNaEuv4COHrrfOTnO7/zQZXgve.ha3yMEjEZ.9n.')

    public function login()
    {
    helper(['form']);
    $session    = session();
    $model      = new UserModel();
    $email      = $this->request->getVar('email');
    $password   = $this->request->getVar('password');
    $data = $model->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'test@gmail.com'
 LIMIT 1